
### Terragrunt diff


```diff


Acquiring state lock. This may take a few moments...
azurerm_resource_group.dev-rg: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg]
azurerm_public_ip.ip-dev: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/publicIPAddresses/ip-dev]
azurerm_nat_gateway.ng-dev: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/natGateways/ng-dev]
azurerm_ssh_public_key.ssh-pub-key: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Compute/sshPublicKeys/global-ssh-key]
azurerm_virtual_network.vnet-dev: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/virtualNetworks/vnet-dev]
azurerm_public_ip.ip-jumpbox: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/publicIPAddresses/ip-address-jumpbox]
azurerm_subnet.subnet-pub-dev-01: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/virtualNetworks/vnet-dev/subnets/subnet-pub-dev-01]
azurerm_nat_gateway_public_ip_association.ng-dev-associate-public-ip: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/natGateways/ng-dev|/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/publicIPAddresses/ip-dev]
azurerm_subnet_nat_gateway_association.name: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/virtualNetworks/vnet-dev/subnets/subnet-pub-dev-01]
azurerm_network_interface.nif-jumpbox: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Network/networkInterfaces/nif-jumpbox]
azurerm_linux_virtual_machine.jumpbox: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg/providers/Microsoft.Compute/virtualMachines/jumpbox]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_record.jumpbox-dns will be created
  + resource "cloudflare_record" "jumpbox-dns" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "jumpbox"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = "4.213.156.249"
      + zone_id         = "72b99a897ca7debf9e960abcbab1c124"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...


```
